<?php

namespace Database\Seeders;

use App\Models\Course;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class CourseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        //
        Course::create([
            'name' => '占星初階班',
            'category_id' => 1,
            'price' => 28000,
            'introduction' => '良好的風水可以使家庭收入增加，人丁健康，在選擇居家風水，實在不可不慎。',
            'detail' => '當我們談到風水時，不只是擺設問題，更是關乎居家能量的流動與平衡。一個良好的居家風水設計，能夠提升家庭整體的運勢，包括財運、人際關係、甚至健康狀況。舉例來說，玄關乾淨明亮可引財進門，客廳佈局開闊則象徵家庭和諧；臥室床位擺放得宜，能幫助睡眠品質、提升精神與氣場。此外，風水講求五行平衡，適當加入木、水、火、土、金的元素，也可強化空間的能量流通。無論信與不信，風水在室內設計中都扮演著一種提升舒適感與心理安全感的角色。畢竟，住得安心、看得順眼，運氣自然就來了。',
            'is_featured' => 0,
        ]);

        Course::create([
            'name' => '占星初階班',
            'category_id' => 1,
            'price' => 28000,
            'introduction' => '良好的風水可以使家庭收入增加，人丁健康，在選擇居家風水，實在不可不慎。',
            'detail' => '當我們談到風水時，不只是擺設問題，更是關乎居家能量的流動與平衡。一個良好的居家風水設計，能夠提升家庭整體的運勢，包括財運、人際關係、甚至健康狀況。舉例來說，玄關乾淨明亮可引財進門，客廳佈局開闊則象徵家庭和諧；臥室床位擺放得宜，能幫助睡眠品質、提升精神與氣場。此外，風水講求五行平衡，適當加入木、水、火、土、金的元素，也可強化空間的能量流通。無論信與不信，風水在室內設計中都扮演著一種提升舒適感與心理安全感的角色。畢竟，住得安心、看得順眼，運氣自然就來了。',
            'is_featured' => 0,
        ]);
        Course::create([
            'name' => '占星初階班',
            'category_id' => 1,
            'price' => 28000,
            'introduction' => '良好的風水可以使家庭收入增加，人丁健康，在選擇居家風水，實在不可不慎。',
            'detail' => '當我們談到風水時，不只是擺設問題，更是關乎居家能量的流動與平衡。一個良好的居家風水設計，能夠提升家庭整體的運勢，包括財運、人際關係、甚至健康狀況。舉例來說，玄關乾淨明亮可引財進門，客廳佈局開闊則象徵家庭和諧；臥室床位擺放得宜，能幫助睡眠品質、提升精神與氣場。此外，風水講求五行平衡，適當加入木、水、火、土、金的元素，也可強化空間的能量流通。無論信與不信，風水在室內設計中都扮演著一種提升舒適感與心理安全感的角色。畢竟，住得安心、看得順眼，運氣自然就來了。',
            'is_featured' => 0,
        ]);
        Course::create([
            'name' => '占星初階班',
            'category_id' => 1,
            'price' => 28000,
            'introduction' => '良好的風水可以使家庭收入增加，人丁健康，在選擇居家風水，實在不可不慎。',
            'detail' => '當我們談到風水時，不只是擺設問題，更是關乎居家能量的流動與平衡。一個良好的居家風水設計，能夠提升家庭整體的運勢，包括財運、人際關係、甚至健康狀況。舉例來說，玄關乾淨明亮可引財進門，客廳佈局開闊則象徵家庭和諧；臥室床位擺放得宜，能幫助睡眠品質、提升精神與氣場。此外，風水講求五行平衡，適當加入木、水、火、土、金的元素，也可強化空間的能量流通。無論信與不信，風水在室內設計中都扮演著一種提升舒適感與心理安全感的角色。畢竟，住得安心、看得順眼，運氣自然就來了。',
            'is_featured' => 0,
        ]);
        Course::create([
            'name' => '占星初階班',
            'category_id' => 1,
            'price' => 28000,
            'introduction' => '良好的風水可以使家庭收入增加，人丁健康，在選擇居家風水，實在不可不慎。',
            'detail' => '當我們談到風水時，不只是擺設問題，更是關乎居家能量的流動與平衡。一個良好的居家風水設計，能夠提升家庭整體的運勢，包括財運、人際關係、甚至健康狀況。舉例來說，玄關乾淨明亮可引財進門，客廳佈局開闊則象徵家庭和諧；臥室床位擺放得宜，能幫助睡眠品質、提升精神與氣場。此外，風水講求五行平衡，適當加入木、水、火、土、金的元素，也可強化空間的能量流通。無論信與不信，風水在室內設計中都扮演著一種提升舒適感與心理安全感的角色。畢竟，住得安心、看得順眼，運氣自然就來了。',
            'is_featured' => 0,
        ]);
    }
}
