export const serviceItems = [
    {
      title: "吠陀占星本命",
      price: 18000,
      description:
        "（下訂後助教會和您聯繫）包含一生的各方面狀況，以及個人的幸運色、寶石和加強生命能量、健康、財富、幸運等的咒語。您也可以預先準備想詢問的問題。另外要麻煩您提供：1.大名 2.出生日期 3.出生時間（幾點幾分） 4.出生地點",
    },
    {
      title: "吠陀占星流年",
      price: 8000,
      description:
        "（下訂後助教會和您聯繫）包含接下來一年運勢好的、需要注意的或可能發生重大事件的時間。須先論過本命才能論流年。",
    },
    {
      title: "陽宅風水鑑定（坪數計價）",
      price: 1800,
      description:
        "（下訂後助教會和您聯繫）費用以主建物+附屬建物（室內+陽台/露台）的坪數計價，每坪 NT$1800。另外要請您提供地址以及「尺寸等比例」的紙本室內平面圖哦。",
    },
    {
      title: "古典行星魔法護符",
      price: 15000,
      description:
        "結合中古世紀的索羅門、卡巴拉系統的行星護符。種類有「太陽、月亮、火星、水星、木星、金星、土星」七種行星護符。下訂後助教會和您聯繫，並請說明您的需求或是想做哪款護符。",
    },
    {
      title: "吠陀占星占卜",
      price: 8000,
      description:
        "（下訂後助教會和您聯繫）吠陀占星Prasna占卜系統。一個問題NT$8000（問題可稍微延伸）。",
    },
    {
      title: "吠陀占星擇時",
      price: 12000,
      description:
        "（下訂後助教會和您聯繫）吠陀占星Muhurta擇時系統。請提供想要擇時的時間範圍，約一週會給您擇時結果。因擇時過程複雜，一旦確定時間範圍，不接受中途更改，請重新下訂，所以請一定要確認好時間範圍。",
    },
    {
      title: "吠陀換置占星",
      price: 10000,
      description:
        "（下訂後助教會和您聯繫）換置占星Relocation，用於分析命主在哪個國家地區運勢會好、適合做什麼。適合海外發展或有移居需求的人。",
    },
    {
      title: "客製本命護符",
      price: 30000,
      description:
        "（下訂後助教會和您聯繫）依個人的命盤製作專屬的本命護符，因為需要擇時慢慢繪製，故製作時間約需半年左右。",
    },
    {
      title: "奇門遁甲佈陣",
      price: 15000,
      description: "（下訂後助教會和您聯繫）",
    },
  ];
  